# Добавьте в модуль с загадками функцию, которая принимает на вход строку (текст загадки)
# и число (номер попытки, с которой она угадана). Функция формирует словарь с информацией
# о результатах отгадывания. Для хранения используйте защищённый словарь уровня модуля.
# Отдельно напишите функцию, которая выводит результаты угадывания из защищённого словаря
# в удобном для чтения виде. Для формирования результатов используйте генераторное выражение.

from Pogruzhenie_v_python.funk_sem_6.modul1 import COUNT_POPITOK, spisok_zagadok


spisok_zagadok()
print(COUNT_POPITOK)