# Напишите программу,
# которая получает целое число и возвращает его шестнадцатеричное строковое представление.
# Функцию hex используйте для проверки своего результата.

X = int(input('Число: '))
x = abs(X)
dict_ = {10: 'a', 11: 'b', 12: 'c', 13: 'd', 14: 'e', 15: 'f'}
str_ = ''
while x != 0:
    if x % 16 < 10:
        str_ = f'{x % 16}' + str_
    else:
        y = dict_.get(x % 16)
        str_ = y + str_
    x //= 16
str_ = '0x' + str_
if X < 0:
    str_ = '-' + str_
print(' Это результат моего кода:', str_)
print('Это результат функции hex:', hex(X))


# X = int(input('Число: '))
# x = abs(X)
# str_ = ''
# while x != 0:
#     str_ = f'{x % 2}' + str_
#     x //= 2
# str_ = '0b' + str_
# if X < 0:
#     str_ = '-' + str_
# print(str_)

